{"pages":[],"posts":[{"title":"产品设计的一些想法","text":"最近在陆陆续续强迫自己看一些关于产品的相关文章，“摘抄并思考”了一些文字，借此记录下来 1、产品经理的职责 以前的产品经理：主要负责已经存在的产品，更多的精力是放在营销和推广 现在的产品经理：主要负责0到1的产品，从无到有，从有到优的过程，包括整个产品的生命周期管理。 2、多听客户的需求，但不是所有的需求都要照做一个产品众口难调，尤其是2C的产品，外界的声音非常多，我们当然也必须要学会多听听他们的声音，但是收到声音不一定要照做，因为用户发出的声音只是站在那个用户的角度，甚至是当下他的立场。我们要做的是挖掘这个声音背后的根因，我们要抓大头抓核心，不要面面俱到 3、满足所有的用户是绝对不可能的🙅这个点跟第二点有点像，产品经理的最大的工作就是调研和理解客户的需求，虽然我们要以客户为中心，但是一个客户提需求，我们可以满足，但是100个客户来，我们就要学会优先级，裁决需求甚至我们会发现，很多客户的需求都是自相矛盾的。 4、关注核心用户还是绝大多数用户任何一个产品都有“短头客户”和“长尾客户”，当然在不考虑资源的情况下，我们都可以满足所有的需求，但是我们资源有限，人力有限，我们就要结合我们的产品的目标具体评估，举个例子，如果今年的目标是10w用户流量，我们发现vip付费用户只有2w，那我们肯定优先考虑长尾用户 好了，字数差不多了，其他的想法下次在分享吧～😊","link":"/2022/04/22/%E4%BA%A7%E5%93%81%E8%AE%BE%E8%AE%A1%E7%9A%84%E4%B8%80%E4%BA%9B%E6%83%B3%E6%B3%95/"},{"title":"关于写作","text":"关于“写作”很早就想写东西了，但是败在文笔。确实，从小我就没有养成读书写作的习惯，学生时代中，语文考试的阅读理解和作文，都是套模版度过的。 今天，突然在思考一个问题——为什么我时不时会有想写作的冲动，但是一直都没有落实，原因是什么？ 目前得到如下几个结论： 1、过度注重文字内容我在写一篇文章前，会反反复复的去斟酌，去构思，甚至去设计一下这个文章需要写成什么样子。然后想着想着，时间就过去了，最后，太晚了，放弃！ 其实，最近发现很多博主有现在的成果，他们都是把一天的所见所闻所想写出来，不在意最后写成啥，因为他们认为，观众只有他们自己，算是一个写（流）日（水）记（账）； 其次，文章篇幅不长，就300-400字左右，结束。 2、个人知识储备不够我意识里知道，自己知识储备不够，没看过多少书，所以总觉得自己写的东西不够好，就是记流水账，没有意义。 其实，没有人在意我写的东西，我本来就不是作家。我写给我自己看，就是记录生活的一个平台 3、容易被干扰在准备开干的时候，会被其他的事情所干扰，比如我以前的一句名言——好的工作环境才能造就好的成果，所以我会去收拾一下桌子，收拾累了，就转移去玩手机了。 4、懒“懒”我觉得这个原因比较泛，懒可以翻译成不付出行动，不付出行动背后的原因，可以包括前面说的两点，能力不够，想的过于美好，导致放弃。我个人觉得最大的原因：自控力不够。有了前面两的意识，逼着自己，养成习惯，相信习惯的力量 我也很感谢这次自己的决定，过程中，剖析自己，意识到自己的不足，希望自己可以变好，加油吧！💪","link":"/2022/04/24/%E5%85%B3%E4%BA%8E%E5%86%99%E4%BD%9C/"},{"title":"使用Hexo搭建个人博客","text":"最近一直漫无目的的在网上浏览文章，决定自己搭建一个博客，苦于太穷，买不起服务器，Hexo+GitHub Page简直就是我这种穷孩子的福音。 开始吧！ 搭建框架搭建框架主要分以下几步：1、安装NodeJs——直接去官网下载即可2、安装Hexo基础框架 1npm install -g hexo 3、初始化Hexo框架——在电脑任意位置创建一个目录，例如：myBlog，执行以下命令 1hexo init 4、安装所需要的组件——在Hexo项目的根目录下执行 1npm install 5、编译生成静态页面 1hexo g 6、启动本地服务 1hexo s 7、若推倒了github上，则使用下面的命令进行发布 1hexo d 完成以上步骤，如果显示如下： 1xxxxx http://localhost:4000/. Press Ctrl+C to stop 则说明本地建站成功，访问本地地址就可以看到了～ 更换主题默认的主题确实比较丑！Hexo是支持更换主题的可以在Hexo的主题官网寻找想要的主题每个主题都有对应的使用方法","link":"/2022/04/22/%E4%BD%BF%E7%94%A8Hexo%E6%90%AD%E5%BB%BA%E4%B8%AA%E4%BA%BA%E5%8D%9A%E5%AE%A2/"},{"title":"关于转岗","text":"先做一个简单的自我介绍： 我是一名菊厂打杂工，在公司已经摸爬滚打近6年了，打杂内容涉及：开发、解决方案销售，招聘。目前在开发岗位打杂。 写这篇博客的时候，我已经下定决心要转岗了——follow my heart。其实这已经不是我第一次在公司内部转岗了，我决定记录下来我的心路历程，主要原因是我这次是换了一个赛道，我想记录下我此刻的想法，等到未来再回看这篇文章的时侯——我会不会后悔 1、我不适合干研发——从入职那一刻，我心里一直都明白，我是一个不喜欢干研发的人，因为我是一个不安分的人，静不下心去研究技术。只是刚入公司，我不能砸了我这个“软件工程毕业”的招牌。现在，我还是要认清现实，我要往前走一点，我想做跟人交流，分析理解对方的需求，然后分解回来给研发兄弟开发，同时我去分析调研用户的体验，并优化，在我看来这个工作就是——产品经理 2、找准赛道——已经是公司老油条了，现在的工作感觉四不像，不像研发不想项目经理也不像产品经理，我需要一个正名的产品经理的title，为了我的职业发展,我需要找准赛道，不能像大海的小船漂泊。 3、不安于现在的工作内容——当前的工作内容是我是团队App的H5开发的Owner，主要负责智能家居单品页H5开发，涉及方案涉及等。本以为我可以在现有的前端工作中发挥一下自己的能力，优化体验，但受限于各个原因吧：周边部门配合不给力，本身整体解决方案架构不清楚，产品定位不清晰等，导致很多想法无法实现。所以我想做我可以主导产品的人（虽然很大可能到了新岗位也会有受限因素），所以我决定换岗 4、未来岗位的工作内容——未来的工作是流量产品经理主要是搞定用户场景，和媒体对接进行流量变现，核心目标就是做大用户流量盘子，对于这个工作内容的描述，说实话我的内心是忐忑的，这个描述至少目前在我看来，有点high，我内心没有底气，我本身就不清楚我到底适不适合产品经理，更别说我能不能干好这个流量产品经理，我对我未来工作的计划和安排没有任何的思路。对于这点，我有点胆怯，但是又想到这次换岗的最大目的是换赛道，我要让自己成为一个真正意义上的产品经理，或者说让我自己明白我到底适不适合产品经理，我要知道里面怎么玩的，大不了我再换嘛。所以目前我给自己的一个比较低要求就是:明白自己到底适不适合产品经理、理清产品经理的玩法。 希望未来回看的时候，我不后悔！哈哈哈哈哈😄 PS：这次转岗呢，有个很开心的点是，我的一个好兄弟——阿志😈也顺利跟我要去同一个部门了，我们以后就是搭档了。耶耶耶，终于实现了——可以一起干活的愿望了。希望我们都顺利吧！加油，guys！","link":"/2022/05/08/%E5%85%B3%E4%BA%8E%E8%BD%AC%E5%B2%97/"},{"title":"到底要不要做","text":"这是今天朋友给我发的截图，对产品吐槽——既要也要，什么都要： 其实，这种情况，对于产品经理来说太普通不过了，产品经理的职责是理解用户的需求，但是不是所有用户的需求都要满足。 这个时候产品经理一定一定要理智，一定要分得清，这个需求到底要不要做。可以通过性价比来判断。性价比如何计算的呢，会从以下两个维度： 1、商业价值：这里说的商业价值，不仅是对公司，还有对用户的价值，充分分析一下对公司和用户的利益。 2、实现的难度：这个需求需要多少开发，测试等人力投入，切记一刀切：实现容易就立马做；或者很难实现就不做。 根据上面两个维度得到： 性价比=商业价值/实现难度所以，对于产品经理来说，绝大多的事情都可以转为一个性价比的问题。","link":"/2022/04/27/%E5%88%B0%E5%BA%95%E8%A6%81%E4%B8%8D%E8%A6%81%E5%81%9A/"}],"tags":[{"name":"产品","slug":"产品","link":"/tags/%E4%BA%A7%E5%93%81/"},{"name":"随想","slug":"随想","link":"/tags/%E9%9A%8F%E6%83%B3/"},{"name":"技术","slug":"技术","link":"/tags/%E6%8A%80%E6%9C%AF/"},{"name":"Hexo","slug":"Hexo","link":"/tags/Hexo/"},{"name":"职业规划","slug":"职业规划","link":"/tags/%E8%81%8C%E4%B8%9A%E8%A7%84%E5%88%92/"}],"categories":[]}